// بيانات الجدول المستخرجة
const data = [
  [],
  [],
  [],
  [],
  [],
  [
     
  ],
  [
    1,
    "2024_3_5_0002",
    "جاد سيف احمد المنتصر",
    20
  ],
  [
    2,
    "2024_3_5_0003",
    "جميلة جمال صالح مسعدالجشوبي",
    14
  ],
  [
    3,
    "2024_3_5_0004",
    "حنان عبده مسعد احمد العمري",
    14
  ],
  [
    4,
    "2024_3_5_0005",
    "خديجة ناصر عبدالله صالح النجار",
    19
  ],
  [
    5,
    "2024_3_5_0006",
    "ذكريات محسن عبدالله الجرموزي",
    12
  ],
  [
    6,
    "2024_3_5_0007",
    "سميحة احمد قايد الجشوبي",
    14
  ],
  [
    7,
    "2024_3_5_0008",
    "عبده صالح مثنى عبدالقوي الحقب"
  ],
  [
    8,
    "2024_3_5_0009",
    "علي عبدالحميد عبدالله احمد الزخمي",
    12
  ],
  [
    9,
    "2024_3_5_0010",
    "محسن علي صالح علي الحقب"
  ],
  [
    10,
    "2024_3_5_0011",
    "هلا ناجي احمد صهبان",
    18
  ],
  [
    11,
    "2024_3_5_0012",
    "هنادي ناجي  احمد صهبان"
  ],
  [
    12
  ],
  [
    1
  ],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  []
];

// دالة البحث داخل البيانات
function search(keyword) {
    return data.filter(row => {
        return row.some(cell =>
            cell && cell.toString().toUpperCase().includes(keyword.toUpperCase())
        );
    });
};
